import { Component, OnInit, NgZone } from '@angular/core'
import { LandmarkService } from 'src/app/services/landmark.service'
import { Landmark } from '../../services/landmark.interface'
import { HttpClient } from '@angular/common/http'
import * as L from 'leaflet'
import { marker, LatLngBoundsExpression } from 'leaflet'
import { catchError, throwError } from 'rxjs'

@Component({
	selector: 'app-map',
	templateUrl: './map.component.html',
	styleUrls: ['./map.component.scss'],
})
export class MapComponent implements OnInit {
	createMarker: any
	handleInput() {
		throw new Error('Method not implemented.')
	}
	private map: any
	private districts: [string, string, string, string | null][] = [
		//районы
		[
			'Агрызский район',
			'Әгерҗе районы (рус. Агрызский район) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республиканың төньяк-көнчыгышында урнашкан, Удмуртия белән чиктәш. Административ үзәге — Әгерҗе шәһәре, Казаннан 304 км көнчыгышка таба һәм Ижаудан көньякка 36 км ераклыкта урнашкан. Татар авылы беренче мәртәбә 1646 елда телгә алына. Пугачев восстаниесе басылганнан соң, 1775 елда Әгерҗе Нократ губернасының Сарапул өязе составына керә. 1914-1915 елларда авыл яныннан Казан-Урал тимер юлы салына. Станциягә нигез салынганнан соң Әгерҗе төбәкнең иң эре транспорт төене булып китә. Әгерҗе районы беренче тапкыр 1924 елда оеша. 1963 елда аның территориясенә Алабуга авыл хуҗалыгы районына кертелә, әмма бер елдан Әгерҗе районы элеккеге чикләрдә яңадан торгызыла. 2020 елга районның мәйданы 1796,62 м2 тәшкил иткән.2020 елның сентябрендә Татарстан Республикасы Транспорт һәм юл хуҗалыгы министры киңәшмәсендә Әгерҗе халыкара дәрәҗәдәге яңа транспорт-логистика үзәген урнаштыру мәйданчыгы итеп сайланды. Әгерҗе станциясе Кытайга һәм башка илләргә йөкләр экспортлау өчен терминал булыр дип планлаштырылды. Үзәк проектын Бөтенроссия тимер юл транспорты фәнни-тикшеренү институты эшләде.',
			'https://a.d-cd.net/YQAAAgF9NuA-1920.jpg',
			null,
		],
		[
			'Азнакаевский район',
			'Азнакай районы (рус. Азнакаевский район) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль берәмлек һәм муниципаль берләшмә (муниципаль район). Республиканың көньяк-көнчыгышында урнаша. 2020 ел башына районда 60 129 кеше яши. Шуларның 42 647 се — шәһәр, 17 482 се — авыл халкы. 1931 елның 30 октябрендә барлыкка килә, 1963 елның 1 февралендә территориясе Әлмәт районына бирелә һәм район бетерелә. 1965 елның 12 гыйнварында ТАССР составында административ берәмлек буларак кабат торгызыла[3][4]. Районның сәнәгать предприятиеләре күбесенчә административ үзәктә — Азнакай шәһәрендә урнаша. Монда машина җитештерү һәм металл эшкәртү, җиңел һәм азык-төлек сәнәгате, нефть-газ комплексы предприятиеләре эшли. Район территориясендә Ромашкино нефть ятмасының Азнакай мәйданы урнаша. Азнакай районында Татарстанның иң югары ноктасы — Чатыр-Тау (диңгез өсте биеклегеннән 321,7 м), ул шундый ук исемле табигать тыюлыгында урнаша.',
			'https://aznakaevo-rt.ru/images/uploads/news/2019/9/9/3f27fe7cbcf2b13a318f6e9c8c6235b6.jpg',
			null,
		],
		[
			'Аксубаевский район',
			'Аксубай районы (рус. Аксубаевский район, чуаш. Аксу районĕ) — Татарстан Республикасысоставындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Ул республиканың көньягында, Кама аръягы икътисади районында урнашкан. Административ үзәге - Аксубай шәһәр тибындагы поселогы. Республикада чуваш халкы татар һәм руслардан күпчелекне тәшкил иткән бердәнбер район. Аксубай муниципаль районы икътисадның авыл хуҗалыгы секторы өстенлек иткән районнар төркеменә керә. Җитештерү секторы азык-төлек сәнәгате һәм төзелеш материаллары предприятиеләре, шулай ук эшкәртү производствосындагы кайбер кече предприятиеләр белән тәкъдим ителгән. Районда алты нефть ятмасы ачылган, ләкин күпчелек очракта бу авыр чыгарыла торган, югары күкертле нефть. Аксубай муниципаль районы Казаннан 180 км, Нурлат тимер юл станциясеннән 58 км һәм Чистай шәһәре пристаненнан 85 км ераклыкта? төбәк әһәмиятендәге автомобиль магистралендә урнашкан. Ресурс белән җитәрлек тәэмин ителеш (руда булмаган файдалы казылмалар, урман, җир ресурслары) бар. 2015 елга район мәйданы 1439,2 км2 тәшкил иткән. Республиканың Чистай, Яңа Чишмә, Чирмешән, Нурлат һәм Алексеевск районнары белән чиктәш. Үзәге Аксубай шәһәр тибындагы поселогы (революциягә кадәрге чыганакларда, җирле чиркәү исеме буенча, Троицкий буларак телгә алына).Район климаты уртача континенталь. Ул җылы җәй (июль — 18,6 °С) һәм тотрыклы кар катламы булган уртача салкын кыш белән характерлана. Район Идел аръягы түбәнлегенең көнчыгышында, кече елгаларның аз урнашкан үзәнендә урнашкан. Рельефның биеклеге уртача 160-180 метр; иң түбәне 74 м (Олы Сөлчә елгасы буе), иң биеге — 223 м (Олы Чирмешән һәм Чишмә елгалары арасында). Территориянең зур өлеше Кече Сөлчә һәм Кече Чирмешән, Зур Сөлчәнең уң кушылдыклары арасында урнашкан.',
			'https://ic.pics.livejournal.com/mikulay_pavl/80675018/32229/32229_900.jpg',
			null,
		],
		[
			'Актанышский район',
			'Актаныш районы (рус. Актанышский район) — Россия Федерациясе Татарстан Республикасы составындагы, аның төньяк-көнчыгышында урнашкан муниципаль район һәм административ-территориаль берәмлек. Мәркәзе — Актаныш авылы. 28 авыл җирлеге һәм 87 авылдан тора. 1930 елда барлыкка килә. 1963 елда ТАССР административ берәмлекләрен эреләндерү нәтиҗәсендә район бетерелә, территориясе Минзәлә районына тапшырыла, ләкин 1965 елның 12 гыйнварында ук яңадан торгызыла. 2020 ел башына районда 29 384 кеше яши. Район халкын бары тик авыл халкы гына тәшкил итә. Район территориясендә 1995 елдан бирле Актаныш чыганагы эшләнә. Икътисадның нигезе — авыл хуҗалыгы. 2017 елдан 13 гектар мәйданлы «Актаныш» сәнәгать паркы эшли.',
			'https://primetygorodov.ru/wp-content/uploads/2016/12/9-Актамыш.jpg',
			null,
		],
		[
			'Алексеевский район',
			'Алексеевск районы (рус. Алексеевский район) – Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Ул төбәкнең үзәк өлешендә, Кама елгасының сул як ярында урнашкан. Административ үзәге - Алексеевск шәһәр тибындагы поселогы. Район 1930 елның 10 августында оеша. 1963 елда аны бетерәләр һәм Чистай районы составына тапшыралар, 1964 елның 4 мартында торгызалар. Алексеевск районы мәйданы 2074,4 км2, ул Татарстан Республикасының үзәк өлешендә, «Казан-Ырынбург» федераль әһәмияттәге автомобиль магистрале янында урнашкан. Административ үзәге булган Алексеевское шәһәр тибындагы поселогы Куйбышев сусаклагычы ярында, Казаннан көньяк-көнчыгышка таба 108 км ераклыкта урнашкан. Чистай, Аксубай, Нурлат, Әлки, Спас районнары белән чиктәш, Куйбышев сусаклагычы акваториясе буенча — Лаеш һәм Балык Бистәсе районнары белән чиктәш.',
			'https://tatmitropolia.ru/www/news2020/6/3zfJP2AJL2Y.jpg',
			null,
		],
		[
			'Алькеевский район',
			'Əлки муниципаль районы (Әлки районы, рус. Алькеевсᴋий район) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Район территориясе 21 авыл җирлегенә бүленгән 70 торак пунктны үз эченә ала. Административ үзәге - Базарлы Матак авылы. 2020 ел башына халык саны 18 675 кеше тәшкил итә. Район республиканың көньягында урнашкан. Самар һәм Сембер өлкәләре, шулай ук Татарстан Республикасының Спас, Алексеевск һәм Нурлат районнары белән чиктәш. Урман массивлары территориянең төньяк, төньяк-көнбатыш өлешләрендә сакланган. Төп елгалары: Кече Чирмешән (кушылдыклары Ата, Шия, Юхмачы), Актай һәм Бизнә. Уртача еллык температура +2,8°С, гыйнварның уртача температурасы -13-14°С, июль +18-20°С тәшкил итә. Уртача еллык явым-төшем 430-500 мм тәшкил итә, парга әйләнү — 550-570 мм.',
			'https://sun9-13.userapi.com/impg/CIaD7GY14YO8tTrwVQgsSRbhqUyidlaORLXtvg/2581bUpe4UY.jpg?size=2560x1707&quality=95&sign=9d6e2b51d8d2dc394804cf10335b877f&type=album',
			null,
		],
		[
			'Альметьевский район',
			'Әлмәт районы — Россия Федерациясендәге Татарстан Республикасы составындагы административ-территориаль берәмлек һәм муниципаль берәмлек (муниципаль район). Төбәкнең көньяк-көнчыгышында табыла. Административ үзәк — Әлмәт шәһәре. Әлмәт авылы һәм аның тирәсендәге җирлек беренче тапкыр XVIII гасырның өчтән беренче өлешендә башлап чыганакларда телгә алына. Киләсе гасыр урталарында Әлмәт волосте Самар губернасының Бөгелмә өязе (1920 елдан — кантоны) составында була. Волость район статусын 1930 елның 10 августында алды. Җитәкчелек районда «Алабуга» һәм «Иннополис» үрнәгендә төбәктә өченче махсус икътисадый зона булдырырга планлаштыра. Төзелешнең беренче этабы 2024 елга билгеләнгән.Әлмәт районы Татарстанның көньяк-көнчыгышында урнашкан. Төньякта Сарман, Зәй һәм Түбән Кама, көнбатышта Яңа Чишмә һәм Чирмешән, көньякта Лениногорск һәм Бөгелмә, көнчыгышта Азнакай районнары белән чиктәш. Гомуми мәйданы 2542,93 км². Район составына 99 торак пункт керә. Баш административ үзәк — Әлмәт шәһәре, ул мөстәкыйль муниципаль берәмлек. Район Бөгелмә платосының төньяк-көнбатышында урнашкан. Биредә урынның уртача биеклеге 200-300 метр тәшкил итә. Кичү, Дала Зәе һәм Үргәсалбаш елгалары ага. Төбәктә нефть, ташкүмер һәм башка файдалы казылмалар запаслары бар. Биредә салкычан җәйле һәм сплкын кышлы уртача континенталь климат.',
			'https://ikga.ru/wp-content/uploads/2020/12/geologicheskoe-stroenie-almetjevska.jpg',
			null,
		],
		[
			'Апастовский район',
			'Апас районы (рус. Апастовский район) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Ул төбәкнең көньяк-көнбатышында урнашкан. Район территориясе бер шәһәр һәм 21 авыл җирлегенә берләшкән 72 торак пунктны үз эченә ала. 2020 ел башына халык саны 19512 кеше тәшкил итә. Административ үзәк — Апас шәһәр тибындагы поселогы. Алтын Урданың, Казан ханлыгының һәм Казан губернасының «Җәбалстаны», яки тарихи «Тау ягы»нда урнашкан. Республиканың Буа, Тәтеш, Кама Тамагы, Югары Ослан, Кайбыч районнары, шулай ук Чуашстанның Ялчык районы белән чиктәш. Көнбатыш өлеше Токмово тектоник своды авышлыгында, калган өлеше — Казан-Киров бөгелешенең көньяк-көнбатыш бортында урнашкан. Рельефы – калкулыклы тигезлек (биеклеге – 140-200 м). Иң зур биеклек - 228 метр, территориянең көньяк өлешендә, Зөя һәм Үләмә елгалары арасында; иң азы — 55 метр — Зөя елгасы буенда, аның озынлыгы 161 км. Барлык су артерияләре аның бассейнына керә. Гомуми озынлыгы 30 км дан артык булган башка эре елгалар: Бола, Үләмә, Коры Үләмә, Бия, Чирмешән, Имәле. Урман массивының гомуми мәйданы - 8,9 мең га. Туфрак караңгы-соры һәм урман, көлсу туфраклар. Район территориясендә акшар, доломит, балчык, ком, торф запаслары бар.',
			'https://apastovo.ru/images/uploads/ckeditor/jpg/5f30e596d703d_Fm9SbMXcmr0.jpg',
			null,
		],
		[
			'Арский район',
			'Арча районы (рус. Арский район) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль берәмлек һәм муниципаль берләшмә(муниципаль район). Республиканың төньягында урнашкан. Административ үзәге — Арча шәһәре. Район территориясендә табигать ядкәрьләренә караган берничә объект урнашкан: Казансу елгасының чишмә башы, Яңасала авышлыгы, Курса соры челән колониясе, «Тукай-кырлай» урманы, «Кул урманы», «Аю Урманы», Казансу һәм Шушма елгалары. Арча районы — Татарстан Республикасының иң зур районнарының берсе, аның мәйданы 1843,7 км2, район буенча Казанны Киров өлкәсе, Удмуртия Республикасы һәм Пермь крае белән тоташтыручы транспорт магистральләре уза. Кама аръягының төньяк өлешендә урнашкан, Балтач, Саба, Теләче, Питрәч, Биектау, Әтнә районнары һәм Марий Эл Республикасы (Мари-Төрек һәм Морке районнары белән чиктәш). Районның административ үзәге Казаннан 60 км ераклыкта урнашкан, башкалага тимер һәм автомобиль юллары белән барып җитәргә мөмкин.',
			'https://tatlin.ru/MyWeb-Image/table/article_photos/field/file/content-field/content/equality-field/id/equality/1346/max-width/1600/1/Казан-су.jpg',
			'https://storage.yandexcloud.net/gap/%D0%90%D1%80%D1%81%D0%BA.mp4?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=YCAJEH6mnjY7di5yjhRldPxW5%2F20240518%2Fru-central1%2Fs3%2Faws4_request&X-Amz-Date=20240518T145436Z&X-Amz-Expires=2592000&X-Amz-Signature=82A5FE3E51A3677ADB665A8DE7FFA0B84A7B66304395B0201FF5EF894303028A&X-Amz-SignedHeaders=host',
		],
		[
			'Атнинский район',
			'Әтнә районы (рус. Атнинский район) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республиканың төньяк-көнбатышында урнашкан. Район территориясе 47 торак пунктны үз эченә ала, алар 12 авыл җирлегенә берләштерелгән. 2020 ел башына халык саны 12 883 кеше тәшкил итә. Административ үзәк — Казан ханлыгы чорында нигез салынган Олы Әтнә авылы. Районның мәйданы 681,4 км2 тәшкил итә. Татарстан Республикасының Арча һәм Биектау районнары һәм Марий Эл Республикасы (Морке районы) белән чиктәш. Рельеф 160-180 метр биеклектәге калкулыклы тигезлектән гыйбарәт. Иң югары нокта — 224 метр, ул Иләт-Ашыт елгаларының төньяк—көнбатышында, иң түбәне — 92 метр, районның көнбатыш чигендә, Ашыт тугаенда урнашкан. Урманнар район мәйданының 3,9 % ын били. Иң зур елга — Ашыт, чишмә башы Арча районында, тамагы — Марий Эл Республикасы территориясендә урнашкан. Иң зур кушылдыклар — Үртамак (16 км), Шәше (15 км), Ура (13 км). Саклана торган табигый территорияләргә «Ашыт» комплекслы тыюлыгы керә, ул 2,7 мең гектар мәйданны били — район территориясеннән 4%. Монда пошилар, кабаннар, төлкеләр, бурсыклар, куяннар беләк һәм кыр куяннары, америка чәшкеләре, сасы көзәннәр һәм ондатрлар, шулай ук 200 дән артык кош-корт очрый.',
			'https://tatarstan.ru/file/photoreport2/print_4602287_3407382.jpg',
			null,
		],
		[
			'Бавлинский район',
			'Баулы районы — Татарстан Республикасы составында административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республиканың көньяк-көнчыгышында урнашкан. Административ үзәге - Баулы шәһәре. 2020 ел башына районда 34 479 кеше яши. Бу территориядә тораклар турында беренче истәлекләр XVII гасырга карый. Район 1930 елның 10 августында ТАССР административ берәмлеге буларак теркәлә. 1963 елда Баулы районы Бөгелмәгә кушыла, ә ике елдан соң Баулы эшчеләр бистәсен үзәк итеп районны кабаттан торгызалар. Көнбатышта Бөгелмә районы, төньякта — Ютазы районы, көнчыгышта — Башкортостан Республикасының Ярмәкәй, Туймазы районнары, Октябрьский шәһәр округы), көнбатышта һәм көньякта — Оренбург өлкәсенең Төньяк һәм Абдулла районнары белән чиктәш. Район территориясе 1222,85 км2, шуның 913,28 км2 - авыл хуҗалыгы җирләре мәйданы. Кара туфрак һәм карбонат туфраклар таралган.',
			'https://bavly.tatarstan.ru/file/news/662_n2106575_big.jpg',
			null,
		],
		[
			'Балтасинский район',
			'Балтач районы — Россия Федерациясенең Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Район 1930 елда ТАССРның административ берәмлеге буларак оештырыла. 1963 елда аны Арча районына кушалар, ә ике елдан, үзәген Балтач шәһәр тибындагы поселогында билгәләп, торгызалар. 2019 елда районда хәләл җитештерү белән шөгыльләнүче компанияләр өчен «Балтач» индустриаль паркы төзелә.',
			'https://miriadagroup.ru/wp-content/uploads/2021/01/Cam_16_Post_LightMix-Interactive-1.jpg',
			'assets/Untitled_Project_V1.mp4',
		],
		[
			'Бугульминский район',
			'Бөгелмә районы — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек. Төбәкнең көньяк-көнчыгышында урнашкан. Административ үзәге - Бөгелмә шәһәре. Шәһәр үз исемен Бөгелмә елгасыннан алган. Хәзерге заман шәһәре урынында авыл беренче тапкыр 1736 ел чыганакларында телгә алына. Патша Россиясендә Бөгелмә өязе Ырынбур губернасының бер өлеше, ә соңыннан Самар губернасының бер өлеше була. 1920 елда өяз ТАССР составында шул ук исемдәге кантонга әверелә. 1930 елның 10 августында кантон берничә районга бүленә, шул исәптән Бөгелмә районы да барлыкка килә. Бөгелмә муниципаль районы Татарстанның көньяк-көнчыгышында урнашкан һәм Республиканың Азнакай, Әлмәт, Баулы, Лениногорск һәм Ютазы районнары, шулай ук Самар (Келәүле районы) һәм Ырынбур (Төньяк район) өлкәләре белән чиктәш. Гомуми мәйданы 1405 км2 тәшкил итә. Район 200-300 метр биеклектәге шул ук исемдәге платода урнашкан. Су ресурслары Бөгелмә Зәе, Дала Зәе, Дим һәм Сулы елгалары белән тәэмин ителгән. Татарстанның көньяк-көнчыгышындагы климат уртача-континенталь, дымлы җәй һәм уртача салкын кыш. Районда флора һәм фаунаның уртача киңлекләре өчен хас булган төрлелеге бар — якынча 913 төр үсемлек һәм 294 төр хайван. Кайбер төрләр Кызыл китапка кертелгән. Район территориясендә аеруча саклана торган табигый объектлар һәм тыюлыклар урнашкан. Иң әһәмиятлеләре арасында: «Адонис урманы» һәм «Яңа Александровка авышлыгы» тыюлыклары, табигать һәйкәлләре - Карабаш тавы, Татар Димескәе Аланы, Ютазы елгасы, яңа эрага кадәр II меңьеллыкның археологик һәйкәлләре һәм башка объектлар бар.',
			'https://key-ms.ru/wp-content/uploads/b/6/6/b661be23a912a48f67281e26b7936e69.jpeg',
			null,
		],
		[
			'Буинский район',
			'Буа районы (рус. Буинский район, чуаш. Пӑва районӗ) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Ул төбәкнең көньяк-көнбатышында урнашкан. Район территориясе 30 авыл һәм 1 шәһәр җирлегенә берләштерелгән 98 торак пунктны үз эченә ала. 2020 ел башына халык саны 41 587 кеше тәшкил итә. По состоянию на начало 2020 года численность населения составляет 41 587 человек. Административ үзәге - Буа шәһәре. Соңрак шәһәр булган авыл 1703 елдан бирле билгеле. Районның мәйданы 1543,6 км2 тәшкил итә. Рельефы 150-200 метр биеклектәге калкулыклы тигезлектән гыйбарәт. Иң зур елга — Зөя, урман-дала зонасы чигендә урнашкан. Аның кушылдыклары — Карлы, Бола, Чынлы. Урманнар 9681 гектар җир били. Климат уртача-континенталь, ул терлекчелек һәм игенчелек өчен уңай шартлар тудыра. Буа районы территориясендә 125 археология һәйкәле урнашкан. Үсемлекләрнең вегетациясе чорында еш кабатланучы корылыклар нәтиҗәсендә район рисклы игенчелек зонасы буларак характерлана. Район территориясе өслегенең рельефы шактый төрле. Аның көнчыгыш яртысы Зөя елгасы үзәненнән көнчыгышка таба Идел буе калкулыгының көнбатыш склоналарыннан гыйбарәт. Биеклекләр югары, аларда районның көнбатыш өлеше биеклеге буенча түбән, анда җир рельефы тигезрәк уртача-дулкынлы.Район территориясе урман-дала зонасы чигендә урнашкан.',
			'http://yataxi-info.com/wp-content/uploads/2020/08/buinsk.jpg',
			null,
		],
		[
			'Верхнеуслонский район',
			'Югары́ Осла́н районы́ (рус. Верхнеуслонский район) — Татарстан Республикасы составында административ-территориаль һәм муниципаль берәмлек (муниципаль район). Идел буе калкулыгының төньяк-көнчыгыш өлешендә, Иделнең уң ярында урнашкан. Административ үзәге — Югары Ослан авылы. Югары Ослан районының бүгенге чикләрен 1931 елда урнаштырганнар. XVI гасырдан башлап халыкның төп шөгыле тау токымын чыгару булган, шуңа күрә 2020 елга район кирпеч җитештерү буенча үз предприятиеләре белән данлыклы. 2012 елдан бирле Иннополис шәһәре территориясендә шул исемдәге махсус икътисади зона урнашкан, ул илдә техник-гамәлгә кертү буенча бишенче булып тора.  Югары Ослан районы Идел буе калкулыгының төньяк-көнчыгыш өлешендә, Иделнең уң як ярында аның Зөя һәм Сөлчә белән кушылган урында урнашкан. Гомуми озынлыгы 15 километрдан да ким булмаган башка эре елгалар: Сөлчә елгасы кушылдыклары Келәнче һәм Чангара, Зөя елгасы кушылдыгы — Бия. Төньякта һәм төньяк-көнбатышта район Яшел Үзән, көньякта һәм көньяк-көнбатышта — Кама Тамагы, Апас һәм Кайбыч районнары белән, Көнчыгышта Идел елгасы аша — Татарстан Республикасының Лаеш районы һәм Казанның Киров районы белән чиктәш. Югары Ослан муниципаль районының мәйданы 130,3 мең га тәшкил итә. шул исәптән урман зонасы — 23 мең га, авыл хуҗалыгы билгеләнешендәге җирләр — 84,8 мең га, сөрүлекләр — 54,1 мең га. Туфрак балчыклы, файдалы казылмалардан акшарлар, балчык, доломитлар, ком һәм комташ бар. Рельеф, нигездә, дулкынлы-тигез, текә ярлар һәм елга үзәннәре, күпсанлы чокырлар һәм балкалар белән аралаш. Административ үзәге — Югары Ослан авылы.',
			'https://sun9-6.userapi.com/impf/ttbFAVxnl0DAkGnX_2o-IsvRjo6TO7s3oWj6jw/IdNmVLr89Lw.jpg?size=1920x768&quality=95&crop=0,106,1280,511&sign=bdc73a0ac51c40cbb3f03cc81a003b03&type=cover_group',
			null,
		],
		[
			'Высокогорский район',
			'Биектау районы (рус. Высокогорский район) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Район Татарстан Республикасының төньяк-көнбатыш өлешендә урнашкан. Административ үзәге - Биектау тимер юл станциясе поселогы. 2020 ел башына халык саны 51 567 кеше тәшкил итә. Хәзерге заман районы территориясендә беренче тораклыклар XII гасырда нигезләнгән дип уйланыла — ул чакта алар Идел буе Болгары тарафыннан контрольдә тотыла. Аларның кайберләре республиканың мәдәни мирас объектлары булып санала. Районда сәнәгать һәм авыл хуҗалыгы комплекслары үсеш алган, өч сәнәгать мәйданчыгы эшли башлаган, тагын бер сәнәгать паркын 2021 елда файдалануга тапшырырга әзерләнәләр. Биектау районы Татарстан Республикасының төньяк-көнбатыш өлешендә, республиканың көньяк һәм төньяк, көнбатыш һәм көнчыгышын тоташтыручы юлларда урнашкан. Район көнбатышта — Яшел Үзән, көнчыгышта — Арча һәм Әтнә районнары, көньякта - Питрәч районы һәм Марий-Эл Республикасы белән төньякта чиктәш. Районның административ үзәге булган Биектау республика башкаласыннан 7 км ераклыкта урнашкан. Район территориясе 1574,8 км2, авыл хуҗалыгы билгеләнешендәге җирләр мәйданы 1188,2 км2 тәшкил итә. Район территориясендә 25 авыл җирлеге урнашкан. Биектау районы Казан агломерациясенең структур берәмлеге булып тора. Климат уртача-континенталь. Сезоннарның төгәл бүленеше билгеләнә. Июльнең уртача температурасы - 18,5 º — 19,5 º, гыйнварда -14,5 º -13,5 º. Райондагы күлләр: Мунчала күле, Сөләнгер күле, Хәбри күле, Юртыш күле,',
			'https://invest.tatarstan.ru/upload/medialibrary/c31/vysokayay-gora.jpg',
			null,
		],
		[
			'Дрожжановский район',
			'Чүпрәле районы (рус. Дрожжановский район, чуаш. Ҫӗпрел районӗ) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Татарстанның көньяк-көнбатыш өлешендә урнашкан. Административ үзәге — Иске Чүпрәле авылы. 2020 ел башына халык саны 21 569 кеше тәшкил итә. Чүпрәле районы аграр, тулаем эчке продукция 2020 елда 0,5 млн. сум тәшкил иткән район. 2014 елдан районда «Чүпрәле» индустриаль паркы эшли, ул 21 резидентка исәпләнгән. Чүпрәле районы Татарстанның көньяк-көнбатыш өлешендә урнашкан, гомуми мәйданы 1029,5 км2 тәшкил итә. Район үзәге, Иске Чүпрәле авылы, Казаннан 200 км көньяк-көнбатышка таба урнашкан. Чүпрәле районы Татарстан Республикасының Буа районы һәм тагын ике төбәк — Чуаш Республикасы (Шомырша районы), төньякта һәм Ульяновск өлкәсе (Сыры, Майна һәм Чынлы районнары) белән чиктәш. Территория 170-220 м биеклектәге абсолют тигезлектән гыйбарәт, ул акрынлап төньяк-көнчыгышка таба түбәнәя. Климат уртача континенталь. Районда көнбатыш һәм көньяк-көнбатыш җилләр күпчелекне тәшкил итә, гыйнварның уртача айлык температурасы -11,5 ºС, июль — +19,1 ºС. Чүпрәле районында Бизнә, Олы Яклы һәм Абамза елгаларының сулыклары урнашкан. Территориядә иң зур Кече Чынлы елгасы, Чынлы елгасының сул як кушылдыгы, көнбатыштан көнчыгышка таба ага. Елга озынлыгы 54 км, шул исәптән район чикләрендә 50 км. Алардан тыш, Зөя елгасы бассейнына Олы Тилчә, Богырна һәм Тимерчән керә.',
			'https://i.ytimg.com/vi/ratAO04kg8M/maxresdefault.jpg',
			null,
		],
		[
			'Елабужский район',
			'Алабуга районы (рус. Елабужский район) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республиканың төньяк-көнчыгышында урнашкан. Административ үзәк — Алабуга шәһәре, Казаннан 215 км һәм Яр Чаллыдан 26 км ераклыкта урнашкан. Археологик тикшеренүләр күрсәткәнчә, Алабуга шәһәре Идел буе Болгар дәүләте вакытында Чулман елгасы кушылган урында барлыкка килгән. 1236 елда бу җирләр Алтын Урданың бер өлеше була. 1780 елда административ реформа нәтиҗәсендә авыл шәһәр статусына һәм Алабуга исеменә ия була, ул вакытта ул Нократ наместниклыгы өязе составына керә. 1921 елның мартыннан шәһәр Алабуга, аннары ТАССР Чаллы кантоннары составына керә. Алабуга районы беренче тапкыр 1930 елның 10 августында оеша. XX гасырда район чикләре берничә тапкыр үзгәрә. Районда «Алабуга» МИЗ урнашкан — Россиядә сәнәгать-җитештерү тибындагы иң зур һәм уңышлы махсус икътисадый зона. Мәйданчык 2006 елда төбәк икътисадын үстерү һәм инвестицияләр җәлеп итү өчен ачылган һәм 2020 елга 57 резидент-компания (33 — гамәлдәгеләр) исәпләнә. 2020 елда резидентларның төбәк икътисадына инвестицияләр күләме якынча 175 млрд.сум тәшкил иткән. Алабуга районы республиканың төньяк-көнчыгышында урнашкан һәм Менделеевск, Мамадыш, Түбән Кама, Тукай районнары, Чаллы шәһәр округы һәм Удмурт Республикасы (Грахово һәм Кизнер районнары) белән чиктәш. Уртача континенталь климатка һәм елның төгәл сезоннарына ия: эссе җәй һәм салкын кыш. Районның иң эре елгалары — Кама, Нократ, шулай ук аларның кушылдыклары (озынлыгы 20 км дан артык)): Кама бассейны елгалары — Туйма, Танай, Юраш (Туйма кушылдыгы), Көрән, Криуша; Нократ бассейны — Үмәк, Әнҗерә (елга), Юраш (Адәмсу кушылдыгы). Район территориясендә «Түбән Кама» милли паркы участогы урнашкан, анда катнаш урманнарның, тайгаларның һәм болын далаларының табигый зоналары тоташа. Биредә төрле үсемлекләр катламы тәкъдим ителгән — урман массивлары урман-дала һәм урман-болын ландшафты белән янәшә һәм якты-соры, соры урман, агач-көлсу туфраклар өстенлек итә. Милли паркта 620 төр үсемлек, 80 төр лишайник һәм башка флора үсә. Биредә 65 төр үсемлек, 153 төр кош һәм 478 төр умырткасызлар яши, аларның күбесе республика һәм федераль Кызыл китапларга кертелгән. Милли паркның төп максатларыннан берсе булып «Шишкин пейзажлары»н һәм төбәк экологиясен саклау тора. «Түбән Кама» җитәкчелеге махсус экотроплар һәм экскурсияләр эшләгән, аларның кайберләре рәссам-алабугалы Иван Шишкинның «Алабуга янында Изге Чишмә», «Алабуга янында Кызыл Тау», «Кораб агачлыгы» («Святой Ключ близ Елабуги», «Красная Горка близ Елабуги», «Корабельная роща») әсәрләре хөрмәтенә аталган.[6] Район территориясендә шулай ук Алабуга шәһәре археологик комплекслары, Ананьино каберлеге һәм башка тарихи-мәдәни мирас объектлары урнашкан. Экология һәм табигатьне саклау мәсьәләләре хакимият һәм район халкы өчен мөһим булып тора. Район активистлары Түбән Кама һәм Яр Чаллы нефть химиясе предприятиеләре җитештерә торган зарарлы матдәләр аркасында һаваның торышына борчылалар. 2020 елның августында «Иделне савыктыру» федераль проекты кысаларында «Алабуга» МИЗ территориясендә чистарту корылмалары реконструкцияләнә. Шулай итеп, федераль һәм республика хакимиятләре предприятиеләрнең әйләнә-тирә мохиткә тискәре йогынтысын киметергә өметләнә.',
			'https://sportishka.com/uploads/posts/2022-11/thumbs/1667587275_9-sportishka-com-p-gorod-yelabuga-dostoprimechatelnosti-krasi-10.jpg',
			null,
		],
		[
			'Заинский район',
			'Зәй районы (рус. Заинский район) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республиканың көнчыгышында урнашкан. Административ үзәге — Зәй шәһәре. Зәй сүзе иске татар телендә елга дигәнне аңлата. 2020 ел башына районда 53 698 кеше яши, шуларның 39 887се — шәһәр халкы, 13 811е — авыл халкы. Район икътисадының нигезе — сәнәгать һәм авыл хуҗалыгы. Авыл хуҗалыгы билгеләнешендәге җирләрнең мәйданы — 1221,49 км2. Район территориясендә Идел буендагы иң эре ДРЭС — Зәй ГРЭСы урнашкан. Район республиканың көнчыгышында урнашкан. Тукай, Сарман, Әлмәт, Түбән Кама районнары белән чиктәш. Территория Бөгелмә-Бәләбәй калкулыгының төньяк-көнбатыш битендә урнашкан. Рельефта яруслылык күзәтелә: түбәне 160-180 м, югарысы 200-240 етр тәшкил итә. Җәй җылы, әмма җитәрлек дәрәҗәдә дымлы, уртача тәүлеклек температура — +15 °С, әмма эсселек һәм корылык чоры кыска (10-15 көн) булырга мөмкин. Кыш бик кырыс һәм карлы, кар инде декабрьдә ява, аның биеклеге 35-40 см тәшкил итә. Уртача гыйнвар температурасы -13 -15 °С тәшкил итә.',
			'https://zainsk-inform.ru/images/uploads/news/2021/3/2/60e96a9732dca1eedb0b4d334728e22f.JPG',
			null,
		],
		[
			'Зеленодольский район',
			'Яшел Үзән районы (рус. Зеленодольский район) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Идел елгасы белән уң як һәм сул як яры өлешләренә бүленгән. Административ үзәге - Яшел Үзән шәһәре. 2020 ел башына район халкы саны 165 915 кеше тәшкил итә. Башта Яшел Үзән судно йөрешле транспортны ремонтлау өчен эш тибындагы бистә буларак уйланылган була. 1932 елда аңа шәһәр статусы бирелә, ә Горький исемендәге суднолар төзү заводы шәһәр төзүче предприятиеләрнең берсе була. Районда Татарстанның төп туристик истәлекле урыннарының берсе булган Зөя утрау-шәһәре урнашкан. Республиканың Идел елгасының ике ярында урнашкан бердәнбер районы. Көнбатыш Чуаш Республикасы (Козловка, Ормар районнары) белән, төньякта — Марий Эл (Волжск районы һәм Волжск шәһәр округы) белән, төньяк-көнчыгышта — Татарстанның Биектау районы белән, көньяк-көнчыгышта — Югары Ослан, көньяк — көнчыгышта — Кайбыч районнары, көнчыгышта Казан белән чиктәш. Район территориясендә Зөя елгасы (Иделнең уң кушылдыгы) һәм Сумка (Иделнең сул кушылдыгы) тамаклары урнашкан. Мәйданы 1396 км2, административ үзәге булып Татарстанда халык саны буенча бишенче шәһәр булган Яшел Үзән шәһәре тора. Райондагы күлләр: Кәрәкә, Сабакай, Шатуниха.',
			'https://cdn.culture.ru/images/09579b73-c28d-5a0c-970c-bf7760c5d757',
			null,
		],
		[
			'Кайбицкий район',
			'Кайбыч районы (рус. Кайбицкий район, чуаш. Хайпăç районĕ) — Татарстан Республикасы составында административ-территориаль һәм муниципаль берәмлек (муниципаль район). Район территориясе 57 торак пунктны һәм 17 авыл җирлеген үз эченә ала. 2020 ел башына халык саны 13 415 кеше тәшкил иткән. Административ үзәге булып Олы Кайбыч авылы тора. 1927 елның февраль-август айларында административ үзәге булып Өлҗән авылы саналган. Кайбыч районы Татарстанның көнбатышында урнашкан. Рельефы тигезлекләр, калкулыклар белән чиратлаша. Иң биек өлеше көнбатышы, алай да биеклеге 150-200 метрдан артмый. Рельефы формалашуда Бозлык чоры тәэсире зур, бозлык монда килеп җитмәсә дә эрегән сулар агымы, туңган туфрак эрү бу җирләрдә кабарынкы, батынкы урыннар барлыкка китергән.',
			'https://sun6-20.userapi.com/impf/aWGGqmmZAkkB7cwy-kErwyGo7yrMSuT-8mfTtw/Q6C-PnH4HGo.jpg?size=1590x530&quality=95&crop=0,114,1080,360&sign=2043db00ff0297e25055e5e345c821bf&type=cover_group',
			null,
		],
		[
			'Камско-Устьинский район',
			'Кама Тамагы районы — Татарстан Республикасы составында административ-территориаль берәмлек һәм муниципаль берәмлек (муниципаль район). Республиканың көнбатышында Идел елгасының уң ярында урнашкан. Тәтеш, Апас, Югары Ослан районнары белән, Куйбышев сусаклагычы акваториясе буйлап Лаеш һәм Спас районнары белән чиктәш. Административ үзәге — Кама Тамагы шәһәр тибындагы поселогы. Районның рельефы уртача 170-190 м биеклектәге калку тигезлектән гыйбарәт. Идел яры буйлап югарылыклар традицион рәвештә «таулар» дип атала: таулар, Богородское таулары, Сөйки таулары, Тәтеш таулары. Район территориясендә шулай ук Лобач тавы, Юрьев мәгарәсе урнашкан, ә 1958 елга кадәр Сөйки мәгарәләре булган, алар сусаклагыч белән су баскан һәм юылган. Күпчелек соры Һәм куе-соры урман туфраклары жирләр таралган. Район территориясендә доломитлар, балчык һәм гипс запаслары (шул исәптән республикада иң эре Кама Тамагы чыганагы) бар. Ятмаларның бер өлеше үз ресурсын (Гипс-1) эшләп чыгарды, Тенеш һәм Сөйки авылларында тау эшләре дәвам итә. Районның көнчыгыш һәм көньяк чигендә Куйбышев сусаклагычы, аның киңлеге 6 км га җитә. Сусаклагыч барлыкка килгәнче, Идел һәм Чулман кушылган урыннар район чикләрендә тулысынча урнашкан. Иң зур елгалар (гомуми озынлыгы 15 км дан ким булмаган)): Зөя бассейны — Коры Үләмә һәм аның кушылдыклары Кыярмәт, Олы Шаһиян. Идел бассейны — Карамалы, Мордвасу, Ишем.',
			'https://pic.rutubelist.ru/video/23/20/2320d3beb6381b4524e562a8b3f5f140.jpg',
			null,
		],
		[
			'Кукморский район',
			'Кукмара районы ( тат. Кукмара районы ) — Россия Федерациясе Татарстан Республикасында урнашкан административ-территориаль һәм муниципаль берәмлек ( муниципаль район ). Район Татарстан Республикасының төньяк-көнбатыш өлешендә урнашкан. Кукмара шәһәре районның административ үзәге. 2020 ел башында халык саны 51,567 кеше исәпләнә. Башта бакыр рудасы эшкәртү предприятиясе янында барлыкка килгән Кукмара заводы дип аталган эшчеләр авылы булган. Соңыннан, монда металл эретү заводы эшли башлаган. 2015 елдан торак пункт территориясендә шул ук исемдәге сәнәгать паркы эшли. Кукмара авылы 2017 елда шәһәр статусын ала. 2020 елга торышлы районда шәһәр төзүче өч предприятия бар.',
			'https://turizm.pibig.info/uploads/posts/2023-04/1682612754_turizm-pibig-info-p-kukmor-panorama-turizm-vkontakte-1.jpg',
			null,
		],
		[
			'Лаишевский район',
			'Лаеш районы (рус. Лаишевсᴋᴎй район) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль берәмлек һәм муниципаль берләшмә (муниципаль район). Республиканың көнбатыш өлешендә Идел һәм Чулман елгалары кушылган урында урнашкан. Административ үзәк — Лаеш шәһәре Лаеш районы 1927 елның 14 февралендә оеша. 1963 елда аны Питрәч районына кушалар, әмма ике елдан соң Лаеш шәһәрен үзәк итеп административ берәмлек буларак яңадан торгызалар. Район еш кына рәсми булмаган рәвештә «Державин ягы» дип атала — рус шагыйре Гавриил Державин тумышы белән Лаеш районнынан. Лаеш районы Казаннан көньяк-көнчыгышка таба 62 км ераклыкта Куйбышев сусаклагычы ярында урнашкан. Аның территориясе 2094,43 км2. Казан, Питрәч, Балык Бистәсе районнары белән, Куйбышев сусаклагычы акваториясе буенча Югары Ослан, Кама Тамагы, Алексеевск, Спас районнары белән чиктәш. Идел, Кама һәм Мишә — районның эре елгалары. Райондагы күлләр: Кара күл, Кара күл, Куак күле, Мишән күле, Саф күл, Хәерби күле, Чат күле, Чиста күл, Куян күле, Чардаклы күле.',
			'https://tatarstan24.tv/images/uploads/news/2023/2/22/098062992c7013186a7d5cdab3a3fc4a.jpg',
			null,
		],
		[
			'Лениногорский район',
			'Лениного́рск районы (тат. Лениногорск районы) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республиканың көньяк-көнчыгышында, Дала Зәе елгасының югаргы агымында урнашкан. Административ үзәге — Лениногорск шәһәре. Хәзерге Лениногорск урынында 1795 елда Яңа Писмән биләмәсенә нигез салынган. XIX гасырда Яңа Писмән вулысы башта Ырынбур губернасы Бөгелмә өязенә, соңрак — Самар губернасына кергән. 1955 елның 18 августында, Яңа Писмән районы Татар АССРының бер өлеше булгач, җирлек шәһәр статусын ала һәм аңарга революционер Владимир Ленин исеме бирелә — Лениногорск дип атала башлый. Район да шушы исем белән йөртелә. Лениногорск районы үзенең исемен торак пункт атамасыннан алган (хәзер — административ үзәк). 1955 елга чаклы Лениногорск Яңа Писмән дип аталган, ул үз чиратында Иске Писмән авылыннан (шулай ук Ясаклы Писмән) XIX гасырда аерылып чыккан. Географ Евгений Поспелов күрсәтүенчә, гомуми Писмән топонимы Татарстанның елга һәм авыллары исемендә еш очраган писмән яки пичмән татар сүзен рус сүзенә охшату аша барлыкка килгән.',
			'https://turizm.pibig.info/uploads/posts/2023-05/1683628558_turizm-pibig-info-p-dostoprimechatelnosti-leninogorska-turizm-7.jpg',
			null,
		],
		[
			'Мамадышский район',
			'Мамадыш районы (рус. Мамадышский район) – Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Ул Татарстанның төньяк-көнчыгышында урнашкан. Административ үзәге — Мамадыш шәһәре. XII гасырда район урынында «Ак кирмән» җирлеге урнашкан була, Мамадыш районының бүгенге чикләре 1930 елда билгеләнә. Аның территориясендә «Вятка» сәнәгать паркы һәм «Сельхозтехника» һәм «Сельхозхимия» ике сәнәгать мәйданчыклары эшли. Мамадыш районы Татарстан Республикасының төньяк-көнчыгышында, Рус тигезлегенең көнчыгыш өлешендә урнашкан. Көнчыгыштан аңа «Алабуга» МИЗ, көнбатышта район Теләче һәм Саба районнары, төньяктан — Татарстанның Кукмара районы, төньяк-көнчыгышта Удмурт Республикасы белән чиктәш. Район чикләре көнчыгышта Нократ елгасы, нөньяк — Кама елгасы белән билгеләнә. Су фонды мәйданы 98 м2 тәшкил итә. Мамадыш районы Киров өлкәсенә якын. Территориянең озынлыгы төньяктан көньякка 70 км, көнбатыштан көнчыгышка — 80 км. гомуми мәйданы — 2,6 км. м2. Районның континенталь климаты: җәйге сезон коры һәм озын түгел, әмма кыш җылы.',
			'https://mamadysh-rt.ru/images/uploads/news/2022/8/10/6bdac7f6c573918da41134a84bf8c4c5.jpg',
			null,
		],
		[
			'Менделеевский район',
			'Менделеевск районы — Татарстан Республикасы составында административ-территориаль һәм муниципаль берәмлек (муниципаль район). Кама елгасының уң ярында һәм Туйма елгасында (Кама кушылдыгы), Казаннан 238 чакрым ераклыкта урнашкан. Административ үзәге - Менделеевск шәһәре. 2020 ел башына район халкы саны 30 064 кеше тәшкил итә. Хәзерге Менделеевск районы территориясендә беренче тораклыклар XVII гасырда барлыкка килә. 1868 елда Капитон Ушков торгызган химия заводы район үсешенә төп этәргеч булып тора. 2019 елда Менделеевскта ТОСЭР (алгарышлы үсеш территориясе) булдырыла, ул Татарстан Республикасында бишенче була. 2020 елга территория резидентлары булып алты компания тора. Менделеевск муниципаль районы төньякка таба Удмурт Республикасы, көнбатышта — Алабуга районы, көньякта — Тукай һәм көнчыгышта — Татарстан Республикасының Әгерҗе районнары белән чиктәш. Гомуми мәйданы 746,4 км2. Районның административ үзәге - Менделеевск шәһәре.',
			'https://mendeleevskyi.ru/images/uploads/news/2022/8/11/66e2547f5e589092f0b933c41e013590.jpg',
			null,
		],
		[
			'Мензелинский район',
			'Минзәлә районы (рус. Мензелинский район) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек. (муниципаль район). Республиканың төньяк-көнчыгыш өлешендә Кама елгасының уң ярында урнашкан. Административ үзәге - Минзәлә. Башта район урынында рус атучылары форпосты урнашкан булган. Хәзерге район 1930 елда оешкан. Минзәлә районы Бөек Ватан сугышы елларында биредә Советлар Берлеге Каһарманы Муса Җәлил яшәгәнлеге белән мәгълүм. Минзәлә муниципаль районы Татарстан Республикасының төньяк-көнчыгыш өлешендә, Башкортстан һәм Удмуртия чикләреннән ерак түгел, Татарстан башкаласы Казаннан 290 километр ераклыкта, Кама елгасының сул як ярында урнашкан. Көньякта — Мөслим, көнбатышта - Тукай, көньяк — көнбатышта — Сарман һәм көнчыгышта - Актаныш районнары белән чиктәш. Районның административ үзәге — Минзәлә. Рельефы, нигездә, тигез, районның көнбатышында биеклеге 300 метрга кадәр. Район җирләренең бер өлеше Түбән Кама сусаклагычын төзү нәтиҗәсендә су астында калган. Район мәйданы 1919 квадрат километр, бу барлык Татарстан Республикасы мәйданының 2,8 процентын тәшкил итә. Район территориясенең 45 процентка якыны — сөрүлекләр, 24 проценты — болыннар, 12 проценты - урманнар, 8 процентк якыны-көтүлекләр. Гыйнварның уртача температурасы -12,1 °С. Декабрь аеннан февральгә кадәр, нигездә, аяз һәм чагыштырмача тыныч һава торышы булганда, көчле салкыннар күзәтелә. Июльнең уртача температурасы +19,4 °С тәшкил итә.',
			'https://must-see.top/wp-content/uploads/2019/04/menzelinsk.jpg',
			null,
		],
		[
			'Муслюмовский район',
			'Мөслим районы – Россия Федерациясенең Татарстан Республикасы составында административ-территориаль һәм муниципаль берәмлек (муниципаль район). Административ үзәге — Мөслим авылы. 2020 ел башына районда 19 326 кеше яши. Район халкы бары тик авыл халкы белән генә тәкъдим ителгән. Район 1930 елның 10 августында оештырыла. 1959 елда аңа бетерелгән Калинин районы территориясенең бер өлеше кушыла. 1963 елның 1 февраленнән, территориясы Сарман һәм Минзәлә районнарына күчерелгәнлектән, бетерелә ләкин 1965 ел ахырында ук хәзерге чикләр белән торгызыла. Район территориясендә нефть ятмалары аз. Аларда 2002 елдан бирле Мәлләнефть эшли. Икътисадның төп тармагы — авыл хуҗалыгы. Район территориясендә биологик (ботаник) профильле «Нарат Асты наратлыгы» дәүләт табигый тыюлыгы урнашкан. Район Татарстанның көнчыгыш өлешенә, Ык елгасы буена урнашкан. Төньяктан — Актаныш, төньяк-көнбатыштан — Минзәлә, көньяк һәм көньяк-көнбатыштан — Азнакай һәм Сарман районнары, көнчыгыштан Башкортстан Республикасының Бакалы районы белән чикләнә. Мәйданы 1466,2 кв. м, соңгы исәпләүләр буенча халкы 22742 кеше яши. Район үзәгендә 7538 кеше яши. Халыкның күп өлешен татарлар (20197 кеше), руслар (1546), марилар (617) тәшкил итә. 36 башкорт кешесе бар. Мөслим төбәге урман-дала зонасына керүгә карамастан, территория типик тигезлектән гыйбарәт. Биеклекләр диңгез өсте тигезлегеннән 100-200 метрга, районның көньяк-көнчыгышында максималь биеклек 257,7 метрга кадәр җитә. Районның елга челтәре Мәллә кушылдыклары белән Ык елгасы тәшкил итә. Таулыкларның чагыштырмача биеклеге Ык елгасы өсте тигезлегеннән 70-80 метр. Туфрак составы төрле: Ык елгасының сулъяк һәм төньяк-көнчыгыш өлешендәге хуҗалыкларда кара туфрак, елганың уң ягында соры урман-дала туфрагы, Ык елгасы буйлап комлы полоса сузылган. Климат — уртача континенталь: җәй җылы һәм кыш уртача салкын. Еллык температура республиканың минималь температурасы күләмендә 3,8 градус. Иң җылы ай — июль, уртача температура +19,7 °С һәм максималь температура + 39 °С. Ноябрь ахырында тотрыклы кар катламы барлыкка килә, ул елына уртача 150 көн чамасы тора. Гыйнварның уртача температурасы -12,2 °С, еллык минималь температура -49 °С шулай ук гыйнвар аенда теркәлгән. Мөслимдәге метеостанция мәгълүматларыннан күренгәнчә, елга уртача 11 аяз, 154 болытлы, 45 буранлы көн туры килә. Иң күп яуган елларда карның тирәнлеге 90 см, уртача еллык явым-төшем 435 мм тәшкил итә.',
			'https://static.tildacdn.com/cad56e4a-a0cc-4c1f-af5d-8b26529ad301/mustle.jpg',
			null,
		],
		[
			'Нижнекамский район',
			'Түбән Кама районы (рус. Нижнека́мский райо́н ) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республика үзәгендә Кама елгасының сул як ярында урнашкан. Административ үзәге — Түбән Кама шәһәре. 2020 ел башына район халкы саны 276 326 кеше тәшкил итә. Хәзерге Түбән Кама районы авыл җирлекләре турында беренче искәрмәләр XVII гасырга карый. Түбән Кама районы 1965 елда Чаллы районының җирләрен бүлеп бирү нәтиҗәсендә оеша. Түбән Кама районы — Татарстанның төп нефть эшкәртү территорияләренең берсе. 2017 елда район үзәге — Түбән Кама шәһәре — алгарышлы социаль-икътисадый үсеш территориясе статусын ала. Түбән Кама районы Кама елгасы борылмасында урнашкан. Төньякта — Алабуга һәм Мамадыш районнары, көнчыгышта — Тукай муниципаль районы белән чиктәш. Көньяк-көнчыгыш чиге Әлмәт районы белән, көньяк-көнбатышта Яңа Чишмә һәм көнбатышта — Чистай муниципаль районы белән чиктәш. Түбән Кама районының мәйданы — 123 мең гектар, шуның 6153 гектары Түбән Кама шәһәренә туры килә. Районда 65 торак пункт урнашкан. Район чикләренең шактый өлеше төньяк һәм көнбатышта табигый су киртәсе —Кама елгасы һәм Куйбышев сусаклагычы буйлап уза. Районның башка эре елгалары булып Чулман, Чишмә елгасы, Зәй, Кичү, Уратма тора.',
			'https://islamology.ru/wp-content/uploads/2021/11/001.jpg',
			null,
		],
		[
			'Новошешминский район',
			'Яңа Чишмә районы (рус. Новошешминский район) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль берәмлек һәм муниципаль берәмлек (муниципаль район). Район Республиканың үзәк өлешендә урнашкан. Административ үзәге — Яңа Чишмә авылы, Казаннан көньяк-көнчыгышка таба 197 км ераклыкта урнашкан. Хәзерге Яңа Чишмә урынында беренче җирлекләр XVII гасыр башында барлыкка килә. 1652-1656 елларда Чишмә елгасы буенча өскә таба Яңа Чишмә ныгытмасы төзелә. 1920 елга кадәр авыл Казан губернасы Чистай өязенең шул исемдәге волосте үзәге була. 1920 елдан 1930 елга кадәр Татарстан АССРның Чистай кантонына керә. Яңа Чишмә районы беренче тапкыр 1930 елның 10 августында оеша, 1963 елда таркала, аның территориясе 1983 елның 26 апрелендә яңадан торгызыла. Яңа Чишмә районы Татарстанның үзәк өлешендә урнашкан һәм Чирмешән, Аксубай, Чистай, Түбән Кама һәм Әлмәт районнары белән чиктәш. Климат урртача континенталь , җылы җәй һәм салкын кыш. Рельефы көньякка калкып, төньякка таба төшә торган тигез урында урнашкан. Районның ландшафтына катнаш урманнар һәм нарат урманы, шулай ук дистәләгән чишмәләр һәм чыганаклар керә. Районның үзәк һәм көньяк-көнчыгыш өлешләрендә Чишмә, Кичү, Сәкинә, Елховка, Лебедка елгалары ага. Район территориясендә 145 тарихи-мәдәни мирас объекты урнашкан, алар арасында Идел буе Болгары чорындагы һәйкәлләр һәм Иске Кама линиясе участоклары бар. Экология һәм табигатьне саклау мәсьәләләре хакимият һәм район халкы өчен мөһим булып тора. 2005 елда Чишмә елгасына ягулык ага, аны тиздән коткаручылар бетерә. Бу очрактан соң Хакимият һәм белгечләр даими мониторинг үткәрә. Ә 2019 елда экологлар авыл хуҗалыгы җирләрендә законсыз казылма чыгаруны токарлый.',
			'https://alrom.ru/files/content/2023/03/1679560618.jpg',
			null,
		],
		[
			'Нурлатский район',
			'Норлат муниципаль районы (Нурлат районы, рус. Нурлатский район, 1930—1997 елларда — Октябрь районы) — Россия Федерациясе Татарстан Республикасындагы административ-территориаль берәмлек һәм муниципаль берләшмә (муниципаль район). Административ үзәге — Норлат шәһәре. 2020 елга район халкы саны 58 290 кеше тәшкил итә, шул ук вакытта аларның кимендә 33 меңе район үзәгендә яши. Район тарихы Идел буе һәм Чулман буе Болгар чоры белән тыгыз бәйләнгән. Норлат шәһәре элек төрле исемнәргә ия булган: Көньяк Норлат, Норлат-Октябрь, район үзе 1930 елдан 1937 елга кадәр Октябрь районы дип аталган. Районның төп табигый ресурсы — район икътисады өчен хәлиткеч әһәмияткә ия булган нефть. Ә төп икътисади тармаклар — нефть чыгару, эшкәртү сәнәгате һәм авыл хуҗалыгы. Гомуми мәйданы 2308,9 м2 булган социаль-икътисадый үсеш алган муниципаль район Татарстан Республикасының көньягында, Көнбатыш Кама аръягы һәм Самара Идел аръягы территориясендә, Олы Сөлчә елгасының түбән агымында урнашкан. Район буйлап Олы Чирмешән һәм Кондырча елгалары да ага. Ул Әлки, Алексеевск, Аксубай, Чирмешән районнары, Самара (Кошки һәм Чаллыбаш районнары) һәм Ульяновск өлкәсе (Яңа Малыклы районы) белән чиктәш. Геоморфологик яктан Норлат Чирмешән урманлы тигезлегенә керә (урманлыклар 41,1 %). Район урман-дала зонасының көньяк өлешендә ята, анда нефть, бентонит һәм керамзит балчык ятмалары бар. Көлсу-кәсле урман һәм көлсу туфрак күпчелекне тәшкил итә, әмма урыны белән кара туфраклар да бар, бу элегрәк районда урыны белән дала киңлекләре булганы турында сөйли. Район климаты уртача континенталь, шактый йомшак кыш, гыйнвардагы уртача температура −12 °С. Җәй тотрыклы температура белән характерлана, яңгыр яки боз рәвешендәге явым-төшемнәр сезонына 80 мм ны тәшкил итә.',
			'http://www.dictor.ru/i/city/530ffc39a.jpg',
			null,
		],
		[
			'Пестречинский район',
			'Питрә́ч районы́ (рус. Пестречи́нский райо́н) – Россия Федерациясе Татарстан Республикасы составында муниципаль берәмлек. Зур социаль-икътисади уңышка ия булган муниципаль район, гомуми мәйданы – 1361 м², Татарстанның төньяк-көнбатышында урнашкан муниципаль. Административ үзәк – Питрәч авылы. 2019 елда район халык саны 45 054 кеше тәшкил итә. Питрәч районы – Татарстанның авыл хуҗалыгы өлкәсендә иң әһәмиятле төбәкләрнең берсе. Төп икътисади тармаклары арасында ит һәм сөт җитештерү, терлекчелек, кошчылык, ат үрчетү, җәнлекчелек. Район территориясендә республика әһәмиятендәге «Ленино-Кокушкино» Дәүләт тарихи һәм мәдәни музей-тыюлыгы эшли, анда Владимир Ульянов бабасы Александр Бланк утары урнашкан. Шулай ук Питрәч авылы янында тарихи һәйкәл – бронза гасыр Питрәч тукталышы (безнең эрага кадәр XVIII—IX гасырлар) бар. Район Кама елгасының уң ягында урнашкан, гомуми мәйданы 1361 м². Төньякта Питрәч районы Биектау һәм Арча районнары белән чиктәш, көнчыгышта — Теләче, көньякта — Балык Бистәсе һәм Лаеш районнары белән. Төбәкнең көнбатыш өлеше Казанга тоташа.',
			'https://sun6-23.userapi.com/s/v1/if1/doecvHdWnRW_xe7LiCPDG6BpSaNrWyiJlKuOix4MuZ1RiwOisy0BpD-VnPXSPySqdhPJhuld.jpg?size=891x892&quality=96&crop=144,42,891,892&ava=1',
			null,
		],
		[
			'Рыбно-Слободский район',
			'Балык Бистәсе районы — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республиканың үзәк өлешендә, Кама елгасының уң ярында урнашкан. Административ үзәк — Балык Бистәсе шәһәр тибындагы поселогы. 2020 елда халыкның гомуми саны 25 052 кеше тәшкил итә. Район территориясе - 2041,4 км². Балык Бистәсе авылы XVI гасыр ахырында Борис Годунов указы нигезендә төзелә. Җирле төбәктә таралган балык промыселы хөрмәтенә үз исемен алган, аның белән Кама буе авылларында яшәүчеләр шөгыльләнгән. Балык Бистәсе районы административ берәмлек буларак 1927 елда төзелгән. Район авыл хуҗалыгы төбәге булып тора: 1188,95 км² җир авыл хуҗалыгы өчен билгеләнгән, анда өч эре инвестор уңышлы эшли, алар авыл хуҗалыгы җирләренең 35%ын алып тора: «Красный Восток - Агро», «Кулон Агро», «Логос».Район Татарстан Республикасының Лаеш (көнбатышта), Питрәч, Теләче, Саба (төньякта), Мамадыш (көнчыгышта), Чистай һәм Алексеевск (Кама елгасы белән аерыла) районнары белән чиктәш булып тора. Районның җир мәйданы 2041,4 км² тәшкил итә. Рельефы — тигезлекле (100–190 м). Туфрак — якты-соры һәм соры урман туфраклары. Урманлылык 23 %. Район территориясе аша Казан-Яр Чаллы, Казан-Ырынбур юллары үтә.',
			'https://www.tourprom.ru/site_media/images/upload/2016/11/15/photo/69340/2409/pejzazh-019.jpg',
			null,
		],
		[
			'Сабинский район',
			'Саба́ районы́ (рус. Сабинский район) — Татарстанның төньяк өлешендә урнашкан муниципаль районы. Административ үзәге — Байлар Сабасы шәһәр тибындагы бистәсе. Саба районының гомуми мәйданы 1097,7 км² тәшкил итә. 2020 елга районда 31 041 кеше яши. Этник яктан район халкының 96% — татарлар, 3% — руслар, 1% — башка милләт вәкилләре. Кешеләр хәзерге Саба районы территориясенә неолит чорында ук күченә башлый. Байлар Сабасы авылы турында беренче истәлекләр XIII гасырга карый. ТАССР составында Саба районы 1930 елның 10 августында оеша. 2020 елның маенда районда «Саба» индустриаль паркы төзелеше төгәлләнә һәм азык-төлек кластеры булдыру турында игълан ителә. Район республиканың төньяк өлешендә Саба елгасында урнашкан, шулай ук Мишә елгасының өске өлешен били. Балтач, Кукмара, Теләче, Арча районнары белән чиктәш. Ландшафт елга үзәннәре белән бүлгәләнгән калкулыклы тигезлектән гыйбарәт. Район рельефында сулыкларны шартлыча төп дүрт өлешкә бүләргә мөмкин: төньяк (Мишә елгасының өске өлешләре һәм аның  көньяк кушылдыклары арасында), көнбатыш (Кече Мишә һәм Саба елгалары арасында), көньяк-көнчыгыш (Казкаш һәм Инеш кушылдыклары арасында), шулай ук үзәк (Саба һәм Казкаш кушылдыклары арасында). Пермь чорындагы Казан һәм татар яруслары катламнары — доломитлар һәм соргылт төстәге известьташлар, балчык, комлык-лар — территориядәге төп җир токымнары булып тора. Район климаты уртача-континенталь, аңа салкын кыш, җылы җәй һәм җитәрлек дәрәҗәдә явым-төшемнәр хас. Саба районының төп файдалы казылмалары булып кирпеч балчыгы, табигый таш, известь, ком, торф тора. Төзелеш материаллары ясау өчен куллана торган кирпеч балчыгы ятмалары, табигый таш районның бөтен территориясе буйлап таралган. Әмма, табигый ташның зур ятмалары Олыяз һәм Урта Саба авыллары янында урнашкан. Шулай ук Саба районында егермедән артык известьташ ятмалары бар.',
			'https://s0.rbk.ru/v6_top_pics/media/img/6/54/755713013107546.jpg',
			null,
		],
		[
			'Сармановский район',
			'Сарма́н районы (рус. Сармановский район) — Россия Федерациясенең Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Республиканың көнчыгышында урнашкан. Административ үзәге — Сарман авылы. 2020 ел башына районда 34 230 кеше яши. Шуларның 12 695е — шәһәр, 21 535е — авыл халкы. Сарман районы 1930 елда оеша. 1959 елда районга бетерелгән Акташ һәм Яңа Юл районнары территорияләренең бер өлеше кушыла. Сарман районында нефть чыгару үсеш алган. Биредә берничә чыганакның бер өлеше урнашкан. Ромашкино нефть чыганагын эшкәртү белән Җәлилнефть, Мөслим — Мәлләнефть, Нөркәй — ТСНК шөгыльләнә. Төньякта район Татарстанның — Тукай районы, көнчыгышта — Азнакай һәм Мөслим районнары, көньякта — Әлмәт районы, көнбатышта исә Зәй районы белән чиктәш. Сарман районы мәйданы 1385,2 км² тәшкил итә. Көнчыгыш Кама аръягының төньяк-көнчыгыш өлешендә, Минзәлә һәм Мәллә елгаларының су җыю мәйданында (Ык елгасы бассейны) урнашкан. Район территориясендә сакланучы табигый объектлар — Игәнә, Минзәлә, Бохарай боры, Сөлек урманы урнашкан. Район урман-дала зонасында урнашкан һәм сөрелгән территориянең проценты югары булу белән характерлана. Урманнар территориянең ни бары 10 процентын тәшкил итә.',
			'https://cdn.culture.ru/images/3b0c0751-ec83-5578-95fc-6525195e97e1',
			null,
		],
		[
			'Спасский район',
			'Спас районы — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Гомуми мәйданы 2028 км2, республиканың көньяк-көнбатышында урнашкан. Административ үзәге - Болгар шәһәре. 2020 елга район халкы саны 18 599 кеше тәшкил итә. Спас районы аграр юнәлешкә ия, төбәктә җәнлекчелек һәм игенчелек хуҗалыгы үсеш алган. Авыл хуҗалыгы җирләре — 117,8 мең га, көтүлекләр - 16,3 мең га, авыл хуҗалыгына иң эре инвесторлар - «Авангард» азык әзерләү компаниясе, «Болгар» үсемлекчелек ВЗП һәм «Хузангай» аграр предприятиесе. Район территориясендә Болгар шәһәре һәм Болгар тарих-архитектура тыюлыгы урнашкан, ул 2014 елда ЮНЕСКО Бөтендөнья мәдәни мирасы исемлегенә кертелгән. 2017 елда район үзәгендә Болгар ислам академиясе ачыла. Көнчыгышта Спас районы Татарстанның Әлки һәм Алексеевск районнары, көньякта Ульяновск өлкәсе (Иске Майна һәм Мәләкәс районнары) белән чиктәш. Идел акваториясе буенча (Куйбышев сусаклагычы) Тәтеш, Кама Тамагы районнары, Кама акваториясе буенча Лаеш районы белән чиктәш. Идел һәм Камадан тыш, район территориясе буенча уза торган иң зур елгалар — Бизнә һәм Актай. Шулай ук Спас районында Абкаларкүл, Озын күле дә бар. Район урман-дала полосасында урнашкан,аның яшел зонасы (урманлык) 9% ка якын. Спас районының зур өлеше түбән тигезлектә урнашкан, аның уртача биеклеге 60-70 метрдан артмый, төньяк-көнбатыш юнәлештә аз гына тайпылышлар бар. Рельефның иң югары ноктасы районның көньяк-көнчыгыш өлешендә урнашкан һәм 153 метр тәшкил итә. Төбәктә пермь плиоцены һәм чирек төрләре геологик катламнарын очратырга мөмкин. Файдалы казылмалар арасында ком һәм балчык очрый, алар төзелештә еш кулланылалар.',
			'http://temples.ru/private/f000264/264_0190954b.jpg',
			null,
		],
		[
			'Тетюшский район',
			'Тәтеш районы (рус. Тетюшский район) — Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Район Татарстанның көньяк-көнбатышында, Куйбышев сусаклагычының уң ярында урнашкан, ул Сембер өлкәсе, Буа, Апас һәм Кама Тамагы районнары белән чиктәш. Административ үзәге - Тәтеш шәһәре. Тәтеш районының хәзерге заман территориясендә беренче тораклыклар б.э. кадәр V—VI барлыкка килә башлаган, әмма Тәтеш шәһәренә нигез салыну датасы булып 1578 ел санала, Казан алынганнан һәм Казан ханлыгы җимерелгәч, рус воеводалары Иделнең уң як ярында Идел буен саклау өчен ныгытма буларак нигезлиләр. 1781 елда Тәтеш өяз шәһәре статусын ала. Тәтеш районы 1930 елда оеша. Төбәктә авыл хуҗалыгы һәм туризм өлкәсе актив үсеш алган. Тәтеш районында «Озын Алан» тарихи-архитектура табигать паркы урнашкан, аның территориясендә элеккеге Казан губернасы территориясеннән сакланып калган авыл дворян утарларының берсе булган граф Молоствов усадьбасы урнашкан. Тәтеш районы Татарстанның көньяк-көнбатыш өлешендә, Куйбышев сусаклагычының уң як ярында, Идел буе калкулыгында урнашкан. Аның территориясендә «Тәтеш таулары» калкулыклары бар, аларның авышлыгы 50 градуска җитә. Көньякта район Сембер өлкәсе, көнбатышта Буа районы белән, төньяк өлештә — Татарстан Республикасының Апас һәм Кама Тамагы районнары белән чиктәш. 2020 елга район халкы саны 21 584 кеше тәшкил итә.',
			'https://turizm.pibig.info/uploads/posts/2023-05/1683600504_turizm-pibig-info-p-vshikha-gora-tetyushi-turizm-vkontakte-27.jpg',
			null,
		],
		[
			'Тукаевский район',
			'Тукай районы (рус. Тукаевский район) – Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль берәмлек һәм муниципаль берләшмә (муниципаль район). Административ үзәк — Яр Чаллы, әмма шәһәр үзе районга керми. 2020 елга халык саны 42 511 кеше тәшкил итә. Тукай районы — халыкның тормыш дәрәҗәсе һәм икътисадый үсеш күрсәткечләре буенча Татарстан районнары арасында лидерларның берсе. 2019 ел нәтиҗәләре буенча ул республика муниципалитетларының социаль-икътисади үсеше рейтингында бишенче булды, ә 2020 елда беренче өчлеккә керде. Тулаем территориаль продукт күләме — 42,9 млрд.сум, ә аның үсеше темпы 106,9 % тәшкил итте[4][5]. Районда сәнәгать җитештерүе һәм аграр өлкә яхшы үсеш алган. Регионның эре предприятиеләренә «Чаллы-Бройлер», «Кама Беконы», Чаллы элеваторы, Яр Чаллы икмәк комбинаты керә. Яр Чаллыда 2016 елдан бирле алгарышлы социаль-икътисади үсеш территориясе (АСИҮТ) эшләп килә, бу республикадагы мондый биш территориянең иң беренчесе. Тукай районының мәйданы 172 949 гектардан артык тәшкил итә, шуның 20,6 мең гектары урманнар белән капланган[8]. Район республиканың төньяк-көнчыгыш өлешендә урнашкан. Төньякта — Татарстанның Менделеевск һәм Әгерҗе районнары, көнбатышта — Алабуга һәм Түбән Кама, көньякта — Зәй, көнчыгышта — Сарман һәм Минзәлә районнары белән чиктәш. 2020 елга район халкы саны 42 511 кеше тәшкил итә.',
			'https://tatarstan.ru/file/photoreport3/print_7588839_5412532.jpg',
			null,
		],
		[
			'Тюлячинский район',
			'Теләче районы (рус. Тюлячинский район) — Россия Федерациясе Татарстан Республикасындагы административ-территориаль берләмлек һәм муниципаль берәмләшмә(муниципаль район). Район Татарстанның төньяк өлешендә урнашкан, гомуми мәйданы 1160 км2. Административ үзәк — Теләче авылы. 2020 елга район халкы саны 13 778 кеше тәшкил итә. Районның төп юнәлеше — авыл хуҗалыгы: терлекчелек һәм игенчелек эшчәнлекнең нигезе булып тора. Теләче районында 131,7 мең га мәйданлы «Мишә» аучылык заказнигы бар, аның максаты — Татарстанның хайваннар дөньясы объектларын саклау һәм торгызу. Район Татарстан Республикасының төньяк өлешендә урнашкан һәм аның районнары белән генә чиктәш: төньякта — Саба, көнчыгышта — Мамадыш һәм Балык Бистәсе, көньяк-көнбатышта — Питрәч, төньяк-көнбатышта — Арча районнары',
			'https://sun9-84.userapi.com/impg/eKePkkwdq9TMbT7jFWzxWGX-dp6qu5lq2YrMOw/SlIOWw80tX4.jpg?size=2560x1707&quality=95&sign=4de25507a2e32f6e1ff33e799606995f&type=album',
			null,
		],
		[
			'Черемшанский район',
			'Чирмешән районы — Татарстан Республикасы составында административ-территориаль берәмлек һәм муниципаль берәмлек (муниципаль район). Төбәкнең көньяк-көнчыгышында урнашкан. Административ үзәге — Чирмешән авылы. Чирмешән җирлеге 1730 нчы елларда Россия Дәүләтенең Көньяк чигендә төзелгән Яңа Кама аръягы линиясенең шул исемдәге ныгытмасы территориясендә барлыкка килә. Район беренче тапкыр 1930 елның 10 августында Беренче Май исеме астында оеша. 1963 елда аны бетерәләр һәм Октябрь һәм Әлмәт районнарына тапшыралар. 1965 елның 12 гыйнварында районны хәзерге исем астында — Чирмешән яңадан торгызалар. Чирмешән муниципаль районы Татарстанның көньяк-көнбатышында урнашкан, шунда ук Нурлат районы белән чиктәш, көнбатышта - Аксубай районы белән, Яңа Чишмә муниципаль районы белән, төньяк-көнчыгышта - Әлмәт районы, көнчыгышта - Лениногорск районы, көньякта - Самара өлкәсе белән (Челно-Вершинский һәм Шенталинский районнары). Гомуми мәйданы 1364,3 км². Районның су ресурслары: Олы Сөлчә, Чишмә һәм Олы Чирмешән елгаларың. Районның климаты яз көне тиз җылынып китүе белән аерылып тора, ләкин озак вакытлы һәм салкын кыш. Территория урман-дала зонасында урнашкан. Урманнар районның 26% ы каплый, ә территориянең күпчелек өлеше сөрелгән җирләргә туры килә. Биредә көньяк-көнчыгыш Кама аръягы өчен хас булган флора һәм фауна төрлелеге - үсемлекләрнең якынча 932 төре һәм хайваннарның 303 төре бар. Сукыр тычканнар, байбаклар, җирән йомраннар, тушканнар, тычканнар һәм башка дала кимерүчеләре аеруча киң таралган. 1934 елгы интродукциядән соң Чирмешән районында Америка сәшкесе бик киң таралган. Җирле урманнарда юртаклар, бүреләр, төлкеләр һәм ятчәләр яши. Дала һәм урман орнитофауналарыннан монда тургайлар, соры көртлекләр, шадра, спескан, песнәкләр һәм башка төр төрләр бар. Районның махсус сакланучы табигать зоналары 4 гектар мәйданны били. Нефть һәм битум ятмалары бар.',
			'https://i.ytimg.com/vi/kKaVRd87vIM/maxresdefault.jpg',
			null,
		],
		[
			'Чистопольский район',
			'Чистай районы – Татарстан Республикасы составындагы административ-территориаль берәмлек һәм муниципаль берәмлек (муниципаль район). Татарстанның үзәк тигезлегендә, Кама елгасының сулъяк ярында урнашкан. 2020 ел башына район халкының саны 75 675 кеше. Административ үзәге – Чистай шәһәре. Хәзерге Чистай районы территориясендә беренче җирлекләрне искә алуны X гасырга карый. Шунда ук биредә борынгы Джукетау шәһәре урнашкан. Район тагын шуның белән дә билгеле: Бөек Ватан сугышы елларында ССБР Язучылар берлеген бирегә эвакуацияләгәннәр, шуңа күрә берничә ел Чистайда Борис Пастернак, Леонид Леонов, Александр Фадеев һәм башка танылган совет авторлары яшәгән. Чистай районында авыл хуҗалыгы үсеш алган. 2017 елда административ үзәк ТОСЭР (Алга киткән үсеш территориясе) статусын алды. Чистай районы Көнбатыш Чулман аръягында, Татарстанның үзәк тигезлекләрендә, Чулманның сул ярында урнашкан. Көнбатышта Алексеевск районы белән, төньяк-көнбатышта — Балык Бистәсе районы белән, төньяк-көнчыгышта — Мамадыш районы белән, көнчыгышта — Түбән Кама районы белән, көньяк-көнчыгышта - Яңа Чишмә районы һәм көньякта - Татарстанның Аксубай районнары белән чиктәш. Гомуми мәйданы 1823 км². Районның төньяктан көньякка таба сузылуы — 50 км, көнбатыштан көнчыгышка таба — 58 км. Районда нефть, ташкүмер һәм башка файдалы казылмалар запаслары бар.',
			'https://ic.pics.livejournal.com/zdorovs/16627846/1490217/1490217_original.jpg',
			null,
		],
		[
			'Ютазинский район',
			'Ютазы муниципаль районы (Ютазы районы, рус. Ютазинский район) — Россия Федерациясе Татарстан Республикасы составындагы административ-территориаль һәм муниципаль берәмлек (муниципаль район). Административ үзәк — Урыссу шәһәр тибындагы поселогы. 2020 ел башына районда 20 248 кеше яшәгән. Шул исәптән шәһәр халкы — 10 633, авыл халкы — 9615. 1935 елда барлыкка килгән, 1958 елда Урыс дип аталган. 1963 елда бетерелгән. Ютазы районы буларак 1991 елда Баулы районы составыннан чыгару юлы белән торгызылды. Район территориясендә «Урусский» сәнәгать паркы, шулай ук Татарстан Республикасы Президенты Рөстәм Миңнеханов йөкләмәсе буенча Урыссу ДРЭСнең элеккеге хезмәткәрләре өчен төзелгән «Тапарт» сынаулы-эксперименталь машина төзелеше заводы эшләп килә. Ютазы районы территориясендә «Урдалы Тау» табигать һәйкәле урнашкан. Республиканың көньяк-көнчыгышында урнашкан. Татарстан Республикасының Азнакай, Бөгелмә, Баулы районнары һәм Башкортостан (Туймазы һәм Шаран районнары, Октябрьский шәһәр округы) белән чиктәш булып тора. Район территориясе буйлап ага торган иң зур елгалар: Ык (Кама кушылдыгы), Ютазы, Дим (Ык кушылдыгы).',
			'https://avatars.dzeninfra.ru/get-zen_brief/6578950/pub_62f7ed7b956ddd722c942c6f_62f7ed7b956ddd722c942c70/scale_1200',
			null,
		],
		[
			'Городской округ Казань',
			'Казан (тат.лат. Qazan, тат.гар. قزان, рус. Казань) — Татарстан Җөмһүриятенең башкаласы, Россиянең икътисади, мәдәни, сәяси үзәкләренең берсе. Иделнең сул ягында, аңа Казансу кушылу урынында урнашкан зур порт. Шәһәрнең теркәлгән «Россиянең өченче башкаласы» бренды бар, шулай ук ярымрәсми рәвештә ул «Россия федерализмы үзәге (башкаласы)» һәм «бөтендөнья татарларының башкаласы» дип атала. 2005 елда Казан шәһәре 1000-еллыгын бәйрәм итте, 2013 елда Казанда XXVII Җәйге Универсиада узды. 2015 елда — су спорт төрләре буенча Дөнья чемпионаты үткәрелде, ә 2018 елда шәһәр (Россиянең башка шәһәрләр белән) ФИФА Дөнья футбол чемпионатын кабул итә. Казан ханлыгының, Казан өязенең, Казан губернасының һәм Татарстан АССРның тарихи башкаласы (үзәге).',
			'https://mykaleidoscope.ru/x/uploads/posts/2022-09/1663086542_6-mykaleidoscope-ru-p-gorodskoi-okrug-gorod-kazan-krasivo-6.jpg',
			'https://storage.yandexcloud.net/gap/%D0%9A%D0%B0%D0%B7%D0%B0%D0%BD%D1%8C%20%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%B5%D1%81%D0%BD%D1%8B%D0%B5%20%D0%A4%D0%B0%D0%BA%D1%82%D1%8B%20%D0%9E%20%D0%9A%D0%B0%D0%B7%D0%B0%D0%BD%D0%B8%204K.mp4?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=YCAJEH6mnjY7di5yjhRldPxW5%2F20240518%2Fru-central1%2Fs3%2Faws4_request&X-Amz-Date=20240518T152419Z&X-Amz-Expires=2592000&X-Amz-Signature=4C25F66F1AAA747DE419754F600748A034871E68787559EC02EECC99EDD60F28&X-Amz-SignedHeaders=host',
		],
		[
			'Городской округ Набережные Челны',
			'Чаллы (шулай ук Яр Чаллы, Чаллы яр, рус. На́бережные Челны́) — Татарстан Республикасының төньяк-көнчыгышында, Чулман елгасының сул ярында, Мәләкәс кушылган җирдә урнашкан, Татарстан шәһәрләре арасындада зурлыгы һәм әһәмияте буенча икенче урында торган шәһәр. Казан белән арасы 225 км, Түбән Кама белән — 35 км, Алабуга белән — 20 км, Уфа белән — 250 км. Тукай районының (1930–1976 елларда Чаллы районының) үзәге. Зур автомобиль юллары үзәге, елга порты бар.',
			'https://a.d-cd.net/6lnWS1ZutFj8rPS025jWQp0grAo-1920.jpg',
			null,
		],
	]
	private land: [
		number,
		number,
		string,
		string[],
		string,
		string,
		number,
		string
	][] = [
		[
			55.798379,
			49.105238,
			'Колшәриф мәчете',
			[
				'https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Kazan_Kremlin_Qolsharif_Mosque_08-2016_img2.jpg/375px-Kazan_Kremlin_Qolsharif_Mosque_08-2016_img2.jpg',
				'https://mykaleidoscope.ru/x/uploads/posts/2022-10/1666362374_16-mykaleidoscope-ru-p-mechet-kul-sharif-oboi-16.jpg',
				'https://mykaleidoscope.ru/x/uploads/posts/2022-10/1666403508_44-mykaleidoscope-ru-p-seid-kul-sharif-krasivo-50.jpg',
			],
			'Кол Шәриф мәчете — Татарстанның һәм Казанның үзәк мәчете. Казан Кирмәне җирлегендә урнаша.Мәчет татар халкының күренекле дин әһеле, Казанны яклаганда вафат булган сәид Колшәриф исемен йөртә. Мәчетнең 8 манарасы бар. Гөмбәз «Казан бүреге» декоратив элементлары, ләлә чәчәге (Идел буе Болгары уңдырыш символы) белән бизәлгән.Бина төнлә матур яктыртыла. Мәчет Казан ханлыгы чорында шактый данлыклы иде. XVI гасырда Урта Иделдә ул фәнни һәм дини үзәк булган. Казан ханлыгының бәйсезлеге өчен көрәшче, мәшһүр татар каһарманы, шагыйрь, дәүләт эшлеклесе, рухани, сәид Колшәриф хөрмәтенә аталган. 1552 елның 2 октябрендә, ил белән бергә, аның рухи остазы — Колшәрифнең дә гомере киселә. Колшәриф үз шәкертләре белән Җәмигъ мәчете өчен Явыз Иван гаскәрләренә каршы сугышып мәчет баскычларында үтерелеп һәлак булган. Бөек татар каһарманы - Колшәриф истәлегенә баш Казан мәчете аталган. 1552 елда, Явыз Иван гаскәрләре Казан каласын яулап алганда, мәчет тар-мар ителә.',
			'https://sun9-4.userapi.com/impf/c637629/v637629435/1288d/aT0Z6bN2zU0.jpg?size=1080x1321&quality=96&sign=4c4bf83c6b91d07a880f2e0f509db757&c_uniq_tag=EKXYzIeSRux__JX-gU3P94OUpj48RdU5eKgXjPp8DXk&type=album',
			1,
			'Достопримечательность',
		], //кулШариф
		[
			55.800501,
			49.105184,
			'Сөембикә манарасы',
			[
				'https://avatars.dzeninfra.ru/get-zen_doc/1054867/pub_5d5161a0a660d700aeecd27b_5d518473bc251400ad8c9c73/scale_1200',
				'http://s4.fotokto.ru/photo/full/665/6653230.jpg',
				'https://ic.pics.livejournal.com/griqor/26047395/52181/52181_original.jpg',
			],
			'Сөембикә манарасы — Казан Кирмәне җирлегендә урнашкан манара. Элек татарларда Хан мәчете буларак аталды, ләкин соңарак русларда йөргән Башня Сююмбике исеме белән атала башлады. Татар ханлыгы чорыннан сакланып калган бердәнбер бина. Сөембикә манарасы — Казанның танылган архитектура символы. Ул авышлы биналар санына керә, чөнки ул төньяк-көнчыгыш ягына 1,98 метрга ава. Якынча 1730 елларда манарага икебашлы бөркет урнаштырылды. 1980 елларда татар җәмагатьчелеге таләбе буенча манарада Ислам символы — ярым ай урнаштырылды. Үзенең хәзерге вариантында манара 1690 еллардан соң төзелгән диеп санала. Ләкин, башка версияләргә күрә, манара Казан ханлыгы чорында төзелгән һәм шушы вакыттан калган бердәнбер тарихи бина.',
			'https://avatars.dzeninfra.ru/get-zen_doc/1856956/pub_5e9206442df22c6338f56c23_5e927fcb4b3ad201b9ee8258/scale_1200',
			2,
			'Культура',
		], // Башня Суюмбики
		[
			55.800427,
			49.111939,
			'Игенчеләр сарае',
			[
				'https://kartinki.pics/pics/uploads/posts/2022-08/1660295998_7-kartinkin-net-p-dvorets-zemledeltsev-kazan-krasivo-foto-7.jpg',
				'https://msbpartner.ru/wp-content/uploads/1/d/4/1d48dd72f2b84806ec04901462ad132d.jpeg',
				'https://7d9e88a8-f178-4098-bea5-48d960920605.selcdn.net/d5a3c88c-71a2-4c05-ba9f-0583261ab6ab/-/scale_crop/870x490/center/-/quality/best/',
			],
			'Игенчеләр сарае (рус. Дворец земледельцев) — Казанның тарихи үзәгендә бина. Сарай мәйданында, Казан кирмәненең төньяк дивары һәм Казансу яр буе урамы янында урнашкан. Татарстан Җөмһүриятенең авыл хуҗалыгы һәм азык-төлек министрлыгының штаб-фатиры, ветеринариянең баш идарәсенең һәм аның карамагында булган башка оешмаларның штаб-фатиры. Бина Федоровская урамының җимерелгән искергән йортлар урынында корылган. Сарай проекты «Антика-плюс» компаниясе тарафыннан башкарылган. Проект авторы — Леонид Горник. Төзелеш эшләре 2008 елда башланганнар, 2010 елда тәмамаланганнар. Бина торгызу кыйммәте 2,2 млрд сум тәшкил иткән. 2011 елдан сарай янындагы мәйданында 30 август көнне ел саен ачык һавада «Казан көзе» халыкара опера фестивале үткәрелә.',
			'https://avatars.mds.yandex.net/get-altay/1811309/2a0000016bf686e0abce7dd6fb8371aafc55/XXL',
			3,
			'Развлечение',
		], //Дворец земледельцев
		[0, 0, '', ['', '', ''], '', '', 4, ''], //........
		[0, 0, '', ['', '', ''], '', '', 5, ''], //........
		[0, 0, '', ['', '', ''], '', '', 6, ''], //........
		[0, 0, '', ['', '', ''], '', '', 7, ''], //........
		[0, 0, '', ['', '', ''], '', '', 8, ''], //........
		[0, 0, '', ['', '', ''], '', '', 9, ''], //........
		[0, 0, '', ['', '', ''], '', '', 10, ''], //........
		[0, 0, '', ['', '', ''], '', '', 11, ''], //........
		[0, 0, '', ['', '', ''], '', '', 12, ''], //........
		[0, 0, '', ['', '', ''], '', '', 13, ''], //........
		[0, 0, '', ['', '', ''], '', '', 14, ''], //........
		[0, 0, '', ['', '', ''], '', '', 15, ''], //........
		[0, 0, '', ['', '', ''], '', '', 16, ''], //........
		[0, 0, '', ['', '', ''], '', '', 17, ''], //........
		[0, 0, '', ['', '', ''], '', '', 18, ''], //........
		[0, 0, '', ['', '', ''], '', '', 19, ''], //........
		[0, 0, '', ['', '', ''], '', '', 20, ''], //........
		[0, 0, '', ['', '', ''], '', '', 21, ''], //........
		[0, 0, '', ['', '', ''], '', '', 22, ''], //........
		[0, 0, '', ['', '', ''], '', '', 23, ''], //........
		[0, 0, '', ['', '', ''], '', '', 24, ''], //........
		[0, 0, '', ['', '', ''], '', '', 25, ''], //........
		[0, 0, '', ['', '', ''], '', '', 26, ''], //........
		[0, 0, '', ['', '', ''], '', '', 27, ''], //........
		[0, 0, '', ['', '', ''], '', '', 28, ''], //........
		[0, 0, '', ['', '', ''], '', '', 29, ''], //........
		[0, 0, '', ['', '', ''], '', '', 30, ''], //........
	]
	public videoUrl: string | null = null
	public showVideoForDistrict: boolean = false // добавить свойство
	public videoUrlForDistrict: string | null = null
	public categories: string[] = []
	public showFilter = false
	public defaultCategories = [
		'барча',
		'истәлекле урыннар',
		'Һәйкәл',
		'Музейлар',
		'Парклар',
	]
	public markers: any[] = [] // Массив с вашими метками на карте

	constructor(
		private http: HttpClient,
		private landmarkService: LandmarkService,
		private ngZone: NgZone
	) {}

	ngOnInit(): void {
		this.createMap()
		this.addTileLayers()
		this.addTatarstanBorder()
		this.addTatarstan1Border()
		this.addLandmarks()
		this.closeVideo()
		const uniqueCategories = new Set(
			this.land.map((item) => item[3].join(', '))
		)
		this.categories = Array.from(uniqueCategories)
		this.toggleFilter()
	}
	getVideoUrl(landmarkId: number): void {
		this.landmarkService
			.getVideoUrl(landmarkId)
			.pipe(
				catchError((error) => {
					console.error(error)
					return 'Не удалось получить ссылку на видео.'
				})
			)
			.subscribe((videoUrl) => {
				this.videoUrl = videoUrl
			})
	}

	private createMap(): void {
		this.map = L.map('map').setView([55.796037, 49.105486], 8)
	}

	private addTileLayers(): void {
		const osm = L.tileLayer(
			'https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png',
			{
				maxZoom: 17,
				minZoom: 7,
				attribution:
					'&copy; <a href="http://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors',
			}
		)

		const googleHybrid = L.tileLayer(
			'http://{s}.google.com/vt/lyrs=s,h&x={x}&y={y}&z={z}',
			{
				maxZoom: 20,
				subdomains: ['mt0', 'mt1', 'mt2', 'mt3'],
				attribution:
					'&copy; <a href="https://www.google.com/permissions/geoguidelines/">Google</a>',
			}
		)

		const baseMaps = {
			OpenStreetMap: osm,
			'Google Hybrid': googleHybrid,
		}

		L.control.layers(baseMaps).addTo(this.map)

		// установить слой тайлов по умолчанию
		osm.addTo(this.map)
	}

	toggleFilter() {
		this.showFilter = !this.showFilter
	}
	filterLandmarks(category: string) {
		// Если выбранная категория "Все", показать все маркеры
		if (category === 'Все') {
			this.markers.forEach((marker) => {
				marker.setOpacity(1)
			})
		} else {
			// Скрыть маркеры, которые не относятся к выбранной категории
			this.markers.forEach((marker) => {
				const landmark = marker.get('landmark')
				if (landmark[7] !== category) {
					marker.setOpacity(0)
				}
			})

			// Показать маркеры, которые относятся к выбранной категории, но были скрыты ранее
			this.land.forEach((land) => {
				if (land[7] === category) {
					const marker = this.markers.find(
						(marker) => marker.get('landmark') === land
					)
					if (marker) {
						marker.setOpacity(1)
					}
				}
			})
		}
	}

	private addTatarstanBorder(): void {
		this.http.get('assets/Tatarstan.geojson').subscribe((json: any) => {
			const geoJsonLayer = L.geoJSON(json, {
				style: {
					color: 'red',
					weight: 1,
					fillOpacity: 0,
				},
				onEachFeature: (feature, layer) => {
					const districtName = feature.properties.district
					const districtInfo = this.districts.find(
						([name]) => name === districtName
					)

					if (districtInfo) {
						const [name, description, imageUrl, videoUrl] = districtInfo
						layer.bindPopup(`<div style="max-height: 650px; ">
						<h3 style="font-size: 25px; text-align: center; border: 2px solid #f0f8c8; padding: 5px;background-color:#f0f8c8; border-radius: 15px;">${name}</h3>
				  <img src="${imageUrl}" style="height: 240px; width: 300px;border-radius: 60px; ">
				  <p style="height: 150px; overflow-y: auto; margin-bottom: 20px; font-size: 15px; border: 2px solid #f5f5dc; background-color: #f0f8c8; padding: 5px; border-radius: 12px;">
  ${description}
  <style>
    /* Полоса прокрутки для Firefox */
    p {
      scrollbar-width: thin;
      scrollbar-color: #8b8b00 #f0f8c8;
    }

    /* Полоса прокрутки для Chrome, Edge и Safari */
    p::-webkit-scrollbar {
      width: 12px;
    }

    p::-webkit-scrollbar-track {
      background: #f0f8c8;
    }

    p::-webkit-scrollbar-thumb {
      background-color: #8b8b00;
      border-radius: 20px;
      border: 3px solid #f0f8c8;
    }
  </style>
</p>
<button id="video-button" style="position: absolute; top: 40%; left: 49%; transform: translate(-40%, -49%); padding: 10px 20px; background-color: transparent; color: white; border: none; cursor: pointer; font-size: 42px;">&#9658;</button>
				</div>`)

						layer.on('popupopen', () => {
							const videoButton = document.getElementById('video-button')
							if (videoButton) {
								videoButton.addEventListener('click', () => {
									this.openVideoForDistrict(videoUrl)
								})
							}
						})
					} else {
						layer.bindTooltip(districtName, {
							permanent: true,
							direction: 'center',
							className: 'smaller-tooltip',
						})
					}
				},
			}).addTo(this.map)
		})
	}
	private addTatarstan1Border(): void {
		this.http.get('assets/Tatarstan1.geojson').subscribe((json: any) => {
			L.geoJSON(json, {
				style: {
					color: 'green',
					weight: 5,
					fillOpacity: 0,
				},
			}).addTo(this.map)
		})
	}

	public selectedCategory: string | null = null

	private addLandmarks(): void {
		let landmarksToAdd: [
			number,
			number,
			string,
			string[],
			string,
			string,
			number,
			string
		][] = []

		landmarksToAdd = this.land

		landmarksToAdd.forEach((land) => {
			const [
				lat,
				lng,
				name,
				imageUrl,
				description,
				imageCircle,
				landmarkId,
				category,
			] = land
			const icon = L.icon({
				iconUrl: imageCircle,
				iconSize: [30, 30],
				iconAnchor: [18, 18],
				popupAnchor: [0, -25],
				className: 'circle-icon',
			})

			const marker = L.marker([lat, lng], { icon }).addTo(this.map)
			const popupContent = `
	<div class="popup-container">
	  <h3 class="popup-title">${name}</h3>
	  <div class="image-slider">
		<button class="slider-btn prev-btn">&#10094;</button>
		<div class="image-wrapper">
		${imageUrl
			.map(
				(img, index) => `
		  <img class="slider-img" src="${img}"  data-index="${index}" />
		`
			)
			.join('')}
		</div>
		<button class="slider-btn next-btn">&#10095;</button>
	  </div>
	  <p class="popup-description">${description}</p><a id="video-button" style="position: absolute; top: 40%; left: 49%; transform: translate(-40%, -49%); padding: 10px 20px; background-color: transparent; color: white; border: none; cursor: pointer; font-size: 42px;">&#9658;</a>
</div>
`

			marker.bindPopup(popupContent)

			marker.on('popupopen', () => {
				const sliderImages = document.querySelectorAll(
					'.slider-img'
				) as NodeListOf<HTMLElement>
				const prevBtn = document.querySelector(
					'.prev-btn'
				) as HTMLElement | null
				let currentImage = 0

				function updateImage() {
					const wrapper = document.querySelector(
						'.image-wrapper'
					) as HTMLElement
					const offset = 0
					wrapper.style.transform = `translateX(-${
						(currentImage + offset) * 60
					}%)`
				}

				if (prevBtn) {
					prevBtn.addEventListener('click', () => {
						currentImage =
							(currentImage - 1 + sliderImages.length) % sliderImages.length
						updateImage()
					})
				}

				const nextBtn = document.querySelector(
					'.next-btn'
				) as HTMLElement | null
				if (nextBtn) {
					nextBtn.addEventListener('click', () => {
						currentImage = (currentImage + 1) % sliderImages.length
						updateImage()
					})
				}

				updateImage()

				// Ваш изначальный код для обработки события клика на кнопке "Видео"
				const videoButton = document.getElementById('video-button')
				if (videoButton) {
					videoButton.addEventListener('click', () => {
						this.ngZone.run(() => {
							this.getVideoUrl(landmarkId)
						})
					})
				}
			})

			this.markers.push(marker)
		})
	}

	public closeVideo(): void {
		this.videoUrl = null
		this.showVideoForDistrict = false
		this.videoUrlForDistrict = null
	}

	public openVideoForDistrict(videoUrl: string | null): void {
		// изменить тип аргумента
		this.showVideoForDistrict = true
		this.videoUrlForDistrict = videoUrl
	}
}
